import styles from "./computerInfo.module.css"
import Draggable from "react-draggable";
const Inf=(props) => {
    return (
        <Draggable>
            <div className={styles.infoCont}>
                <div className={styles.greyBar}>
                <img src="/images/close.png" onClick={() => props.handleClose("close")} />
                </div>
                <h1>System Corrupt</h1>
                <div className={styles.topCont}>
                <img src="/images/glitchskull.gif" />
                <span>ᛚᛟᚱᛖᛗ ᛁᛈᛋᚢᛗ ᛁᛋ ᛋᛁᛗᛈᛚᛃ ᛞᚢᛗᛗᛃ ᛏᛖᚲᛋᛏ ᛟᚠ ᚦᛖ ᛈᚱᛁᚾᛏᛁᛝ ᚨᚾᛞ ᛏᛃᛈᛖᛋᛖᛏᛏᛁᛝ ᛁᚾᛞᚢᛋᛏᚱᛃ ᛚᛟᚱᛖᛗ ᛁᛈᛋᚢᛗ ᚺᚨᛋ ᛒᛖᛖᚾ ᚦᛖ ᛁᚾᛞᚢᛋᛏᚱᛃᛋ ᛋᛏᚨᚾᛞᚨᚱᛞ ᛞᚢᛗᛗᛃ ᛏᛖᚲᛋᛏ ᛖᚹᛖᚱ ᛋᛁᚾᚲᛖ ᚦᛖ ᛋ ᚹᚺᛖᚾ ᚨᚾ ᚢᚾᚲᚾᛟᚹᚾ ᛈᚱᛁᚾᛏᛖᚱ ᛏᛟᛟᚲ ᚨ ᚷᚨᛚᛚᛖᛃ ᛟᚠ ᛏᛃᛈᛖ ᚨᚾᛞ ᛋᚲᚱᚨᛗᛒᛚᛖᛞ ᛁᛏ ᛏᛟ ᛗᚨᚲᛖ ᚨ ᛏᛃᛈᛖ ᛋᛈᛖᚲᛁᛗᛖᚾ ᛒᛟᛟᚲ ᛁᛏ ᚺᚨᛋ ᛋᚢᚱᚹᛁᚹᛖᛞ ᚾᛟᛏ ᛟᚾᛚᛃ ᚠᛁᚹᛖ ᚲᛖᚾᛏᚢᚱᛁᛖᛋ ᛒᚢᛏ ᚨᛚᛋᛟ ᚦᛖ ᛚᛖᚨᛈ ᛁᚾᛏᛟ ᛖᛚᛖᚲᛏᚱᛟᚾᛁᚲ ᛏᛃᛈᛖᛋᛖᛏᛏᛁᛝ ᚱᛖᛗᚨᛁᚾᛁᛝ ᛖᛋᛋᛖᚾᛏᛁᚨᛚᛚᛃ ᚢᚾᚲᚺᚨᛝᛖᛞ ᛁᛏ ᚹᚨᛋ ᛈᛟᛈᚢᛚᚨᚱᛁᛋᛖᛞ ᛁᚾ ᚦᛖ ᛋ ᚹᛁᚦ ᚦᛖ ᚱᛖᛚᛖᚨᛋᛖ ᛟᚠ ᛚᛖᛏᚱᚨᛋᛖᛏ ᛋᚺᛖᛖᛏᛋ ᚲᛟᚾᛏᚨᛁᚾᛁᛝ ᛚᛟᚱᛖᛗ ᛁᛈᛋᚢᛗ ᛈᚨᛋᛋᚨᚷᛖᛋ ᚨᚾᛞ ᛗᛟᚱᛖ ᚱᛖᚲᛖᚾᛏᛚᛃ ᚹᛁᚦ ᛞᛖᛋᚲᛏᛟᛈ ᛈᚢᛒᛚᛁᛋᚺᛁᛝ ᛋᛟᚠᛏᚹᚨᚱᛖ ᛚᛁᚲᛖ ᚨᛚᛞᚢᛋ ᛈᚨᚷᛖᛗᚨᚲᛖᚱ ᛁᚾᚲᛚᚢᛞᛁᛝ ᚹᛖᚱᛋᛁᛟᚾᛋ ᛟᚠ ᛚᛟᚱᛖᛗ ᛁᛈᛋᚢᛗ</span>
                </div>
                <hr className={styles.vrhr} />
                <p>ỳ̸̢̖͖̰̺͉͉̍̔͐̽͌̐͆͌̔͆̕͝o̸̼͈̱̖̤͎̎͜ͅu̸͚͈͛̅̐̒̀̕ ̸̨͓̩͍̗̭̅̾s̸̮͖͍͛h̷̛̠͙͇̣̲̫̼̳̤̭͑̎̓̌̀̊̇̑͗́́̈͘ô̵̹͎̟͉͚͇̪͙͓̭̲̥͂̌͌͝ư̸͉͆̓͑̐͋̑̈̉͝͝l̷̢̝͎̤̥̲̞̬̞̫̩̄̇̅̊̐̔̃̾͌͗̋̅͠ḓ̷̢͖͙̙̟̰͌͆̿͗͋̎̃͆̋̋͝͠ ̷͈̆͂̽̈́̓̂̏͘͠͝n̴̫̎̌̊͐̄̋̑ó̸̬̮̪̲̖̤͖̩̯̦͚͍͒͂͌̄̆̍̆̕̕͝͝t̴̡͓̘̩̐̓̅́̽̚͝͝͠ ̷̳̓͋̏͒̔̀̂b̴̡̳̣̦̰̱͓̗͊͒̏͒̀̈́̓͊̿͐͛̊̚͜ͅë̵͔̘́̊ ̴̨̫̥̳̪͔̭͙̼͉͈̝̳̖̱̇̓̀͋̋͆͊̓̈́̚͘͘h̶̤͈͚̺̹̓̆̂͐͑́͒e̷̡͚͖̘̪͈̝̻̣̣̠̟͒͑̈́͛̍͌̓̀̿̾̈́͘͝͠͝r̴̢͔̪̪̘͙̫̪͎̟̗̊͗͠ͅe̴̘̟̥̘͐͋̓̃̋̀͘,̷̧̛͚̩͈̼̤̱̯̜̫̫̝̮̳̅͐̕ ̵̥̙͎̠͕̩͕̤̝̼̔̂̊̇̽̌̊̅̆̔͠l̶̘̺̱͖͚͔̗̫͙̲̅ę̸̛̛̜̜͚̙͖͋̈́̂̑̐̀̐̊͌͌̃̕͠ͅa̵̗͖̠̙͍̓̂̆͌̉̈́̒̕͜v̷̬͕̈́̈͝e̴̡͖̲̺̦̼͇̬̣͎͎̙͋̈́͆̓̆̒̿͆̇̋͘͝ ̶̛̥͕̠̔̀̅̆͐̔̈́̓̓͑̄̔̚ͅw̸̧̆̽͐̄͛̆̄̿̕h̵̘͖͉̀̈́̐̇̿͐̃͝i̶̢̛̦͇̦͋̽̆̅̌̽͐̾̔̃͒͜͝ͅl̴̮̾̋̇̈̇̾̀͝ȩ̵̭̫̥͍̯̓ ̸̧̥̫̜̼͚̩̬̤̝̻͖̲͚͑̐͛̐̈̈́̔̚͠y̶̘̻̪̪̘̝̭͓͍̺̩̠̠̼̆̀̐̎̈́̋͠õ̸̢̠̦̥̺͈̘̭̤͇̠͚̪͜͜͝ȕ̸̫̰͈̜͕̮͖̯̇̅̕͜ ̵̛̾̐̀̃͋̔͋̑̈̅͘͝ͅc̶̗̫̖̖͔͚͈̣̐̎̀̔͆̔͝a̷̘̙͍͈̲̪̰̭͑̈́̔͋͛͋̾̓̉̒̓͜n̸͍̦̦̩̮̂̊̇͝ͅ ̵͚͈͖̞͐̓̆̌͒͐̆͋̌̓̍̓̐</p>
            </div>
        </Draggable>
    )
}

export default Inf;